digint/openmptl/arch/stm32f10x/include/arch/nvic.hpp
#ifdef STM32F10X_XL
typedef Irq<18>  IrqADC1_2;                 /**< ADC1 and ADC2 global Interrupt                                      */
typedef Irq<19>  IrqUSB_HP_CAN1_TX;         /**< USB Device High Priority or CAN1 TX Interrupts                      */
typedef Irq<20>  IrqUSB_LP_CAN1_RX0;        /**< USB Device Low Priority or CAN1 RX0 Interrupts                      */
typedef Irq<21>  IrqCAN1_RX1;               /**< CAN1 RX1 Interrupt                                                  */
typedef Irq<22>  IrqCAN1_SCE;               /**< CAN1 SCE Interrupt                                                  */
typedef Irq<23>  IrqEXTI9_5;                /**< External Line[9:5] Interrupts                                       */
typedef Irq<24>  IrqTIM1_BRK_TIM9;          /**< TIM1 Break Interrupt and TIM9 global Interrupt                      */
typedef Irq<25>  IrqTIM1_UP_TIM10;          /**< TIM1 Update Interrupt and TIM10 global Interrupt                    */
typedef Irq<26>  IrqTIM1_TRG_COM_TIM11;     /**< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt   */
typedef Irq<27>  IrqTIM1_CC;                /**< TIM1 Capture Compare Interrupt                                      */
typedef Irq<28>  IrqTIM2;                   /**< TIM2 global Interrupt                                               */
typedef Irq<29>  IrqTIM3;                   /**< TIM3 global Interrupt                                               */
typedef Irq<30>  IrqTIM4;                   /**< TIM4 global Interrupt                                               */
typedef Irq<31>  IrqI2C1_EV;                /**< I2C1 Event Interrupt                                                */
typedef Irq<32>  IrqI2C1_ER;                /**< I2C1 Error Interrupt                                                */
typedef Irq<33>  IrqI2C2_EV;                /**< I2C2 Event Interrupt                                                */
typedef Irq<34>  IrqI2C2_ER;                /**< I2C2 Error Interrupt                                                */
typedef Irq<35>  IrqSPI1;                   /**< SPI1 global Interrupt                                               */
typedef Irq<36>  IrqSPI2;                   /**< SPI2 global Interrupt                                               */
typedef Irq<37>  IrqUSART1;                 /**< USART1 global Interrupt                                             */
typedef Irq<38>  IrqUSART2;                 /**< USART2 global Interrupt                                             */
typedef Irq<39>  IrqUSART3;                 /**< USART3 global Interrupt                                             */
typedef Irq<40>  IrqEXTI15_10;              /**< External Line[15:10] Interrupts                                     */
typedef Irq<41>  IrqRTCAlarm;               /**< RTC Alarm through EXTI Line Interrupt                               */
typedef Irq<42>  IrqUSBWakeUp;              /**< USB Device WakeUp from suspend through EXTI Line Interrupt          */
typedef Irq<43>  IrqTIM8_BRK_TIM12;         /**< TIM8 Break Interrupt and TIM12 global Interrupt                     */
typedef Irq<44>  IrqTIM8_UP_TIM13;          /**< TIM8 Update Interrupt and TIM13 global Interrupt                    */
typedef Irq<45>  IrqTIM8_TRG_COM_TIM14;     /**< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt   */
typedef Irq<46>  IrqTIM8_CC;                /**< TIM8 Capture Compare Interrupt                                      */
typedef Irq<47>  IrqADC3;                   /**< ADC3 global Interrupt                                               */
typedef Irq<48>  IrqFSMC;                   /**< FSMC global Interrupt                                               */
typedef Irq<49>  IrqSDIO;                   /**< SDIO global Interrupt                                               */
typedef Irq<50>  IrqTIM5;                   /**< TIM5 global Interrupt                                               */
typedef Irq<51>  IrqSPI3;                   /**< SPI3 global Interrupt                                               */
typedef Irq<52>  IrqUART4;                  /**< UART4 global Interrupt                                              */
typedef Irq<53>  IrqUART5;                  /**< UART5 global Interrupt                                              */
typedef Irq<54>  IrqTIM6;                   /**< TIM6 global Interrupt                                               */
typedef Irq<55>  IrqTIM7;                   /**< TIM7 global Interrupt                                               */
typedef Irq<56>  IrqDMA2_Channel1;          /**< DMA2 Channel 1 global Interrupt                                     */
typedef Irq<57>  IrqDMA2_Channel2;          /**< DMA2 Channel 2 global Interrupt                                     */
typedef Irq<58>  IrqDMA2_Channel3;          /**< DMA2 Channel 3 global Interrupt                                     */
typedef Irq<59>  IrqDMA2_Channel4_5;        /**< DMA2 Channel 4 and Channel 5 global Interrupt                       */
#define LAST_IRQ_CHANNEL  59
#endif // STM32F10X_XL

#ifdef STM32F10X_CL
typedef Irq<18>  IrqADC1_2;                 /**< ADC1 and ADC2 global Interrupt                               */
typedef Irq<19>  IrqCAN1_TX;                /**< USB Device High Priority or CAN1 TX Interrupts               */
typedef Irq<20>  IrqCAN1_RX0;               /**< USB Device Low Priority or CAN1 RX0 Interrupts               */
typedef Irq<21>  IrqCAN1_RX1;               /**< CAN1 RX1 Interrupt                                           */
typedef Irq<22>  IrqCAN1_SCE;               /**< CAN1 SCE Interrupt                                           */
typedef Irq<23>  IrqEXTI9_5;                /**< External Line[9:5] Interrupts                                */
typedef Irq<24>  IrqTIM1_BRK;               /**< TIM1 Break Interrupt                                         */
typedef Irq<25>  IrqTIM1_UP;                /**< TIM1 Update Interrupt                                        */
typedef Irq<26>  IrqTIM1_TRG_COM;           /**< TIM1 Trigger and Commutation Interrupt                       */
typedef Irq<27>  IrqTIM1_CC;                /**< TIM1 Capture Compare Interrupt                               */
typedef Irq<28>  IrqTIM2;                   /**< TIM2 global Interrupt                                        */
typedef Irq<29>  IrqTIM3;                   /**< TIM3 global Interrupt                                        */
typedef Irq<30>  IrqTIM4;                   /**< TIM4 global Interrupt                                        */
typedef Irq<31>  IrqI2C1_EV;                /**< I2C1 Event Interrupt                                         */
typedef Irq<32>  IrqI2C1_ER;                /**< I2C1 Error Interrupt                                         */
typedef Irq<33>  IrqI2C2_EV;                /**< I2C2 Event Interrupt                                         */
typedef Irq<34>  IrqI2C2_ER;                /**< I2C2 Error Interrupt                                         */
typedef Irq<35>  IrqSPI1;                   /**< SPI1 global Interrupt                                        */
typedef Irq<36>  IrqSPI2;                   /**< SPI2 global Interrupt                                        */
typedef Irq<37>  IrqUSART1;                 /**< USART1 global Interrupt                                      */
typedef Irq<38>  IrqUSART2;                 /**< USART2 global Interrupt                                      */
typedef Irq<39>  IrqUSART3;                 /**< USART3 global Interrupt                                      */
typedef Irq<40>  IrqEXTI15_10;              /**< External Line[15:10] Interrupts                              */
typedef Irq<41>  IrqRTCAlarm;               /**< RTC Alarm through EXTI Line Interrupt                        */
typedef Irq<42>  IrqOTG_FS_WKUP;            /**< USB OTG FS WakeUp from suspend through EXTI Line Interrupt   */
typedef Irq<50>  IrqTIM5;                   /**< TIM5 global Interrupt                                        */
typedef Irq<51>  IrqSPI3;                   /**< SPI3 global Interrupt                                        */
typedef Irq<52>  IrqUART4;                  /**< UART4 global Interrupt                                       */
typedef Irq<53>  IrqUART5;                  /**< UART5 global Interrupt                                       */
typedef Irq<54>  IrqTIM6;                   /**< TIM6 global Interrupt                                        */
typedef Irq<55>  IrqTIM7;                   /**< TIM7 global Interrupt                                        */
typedef Irq<56>  IrqDMA2_Channel1;          /**< DMA2 Channel 1 global Interrupt                              */
typedef Irq<57>  IrqDMA2_Channel2;          /**< DMA2 Channel 2 global Interrupt                              */
typedef Irq<58>  IrqDMA2_Channel3;          /**< DMA2 Channel 3 global Interrupt                              */
typedef Irq<59>  IrqDMA2_Channel4;          /**< DMA2 Channel 4 global Interrupt                              */
typedef Irq<60>  IrqDMA2_Channel5;          /**< DMA2 Channel 5 global Interrupt                              */
typedef Irq<61>  IrqETH;                    /**< Ethernet global Interrupt                                    */
typedef Irq<62>  IrqETH_WKUP;               /**< Ethernet Wakeup through EXTI line Interrupt                  */
typedef Irq<63>  IrqCAN2_TX;                /**< CAN2 TX Interrupt                                            */
typedef Irq<64>  IrqCAN2_RX0;               /**< CAN2 RX0 Interrupt                                           */
typedef Irq<65>  IrqCAN2_RX1;               /**< CAN2 RX1 Interrupt                                           */
typedef Irq<66>  IrqCAN2_SCE;               /**< CAN2 SCE Interrupt                                           */
typedef Irq<67>  IrqOTG_FS;                 /**< USB OTG FS global Interrupt                                  */

#define LAST_IRQ_CHANNEL  67
#endif // STM32F10X_CL


extern const uint32_t _stack_top;  // provided by linker script

/* Configure vector table */
typedef VectorTableBuilder<LAST_IRQ_CHANNEL + 1, &_stack_top>::value VectorTable;

#undef LAST_IRQ_CHANNEL

#endif // NVIC_HPP_INCLUDED
